## Movies Recommendation System

### **Import Libraries**

In [1]:
import pandas as pd
import ast
import numpy as np

**Read Data**

In [2]:
df = pd.read_csv('movies.csv')
df.head(3)

,index,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,...,runtime,spoken_languages,status,tagline,title,vote_average,vote_count,cast,crew,director
0,0,237000000,Action Adventure Fantasy Science Fiction,http://www.avatarmovie.com/,19995,culture clash future space war space colony so...,en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,...,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800,Sam Worthington Zoe Saldana Sigourney Weaver S...,"[{'name': 'Stephen E. Rivkin', 'gender': 0, 'd...",James Cameron
1,1,300000000,Adventure Fantasy Action,http://disney.go.com/disneypictures/pirates/,285,ocean drug abuse exotic island east india trad...,en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,...,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500,Johnny Depp Orlando Bloom Keira Knightley Stel...,"[{'name': 'Dariusz Wolski', 'gender': 2, 'depa...",Gore Verbinski
2,2,245000000,Action Adventure Crime,http://www.sonypictures.com/movies/spectre/,206647,spy based on novel secret agent sequel mi6,en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,...,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466,Daniel Craig Christoph Waltz L\u00e9a Seydoux ...,"[{'name': 'Thomas Newman', 'gender': 2, 'depar...",Sam Mendes

In [3]:
df.shape

(4803, 24)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4803 entries, 0 to 4802
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   index                 4803 non-null   int64
 1   budget                4803 non-null   int64
 2   genres                4775 non-null   object
 3   homepage              1712 non-null   object
 4   id                    4803 non-null   int64
 5   keywords              4391 non-null   object
 6   original_language     4803 non-null   object
 7   original_title        4803 non-null   object
 8   overview              4800 non-null   object
 9   popularity            4803 non-null   float64
 10  production_companies  4803 non-null   object
 11  production_countries  4803 non-null   object
 12  release_date          4802 non-null   object
 13  revenue               4803 non-null   int64
 14  runtime               4801 non-null   float64
 15  spoken_languages      4803 non-null   object
 16  status                4803 non-null   object
 17  tagline               3959 non-null   object
 18  title                 4803 non-null   object
 19  vote_average          4803 non-null   float64
 20  vote_count            4803 non-null   int64
 21  cast                  4760 non-null   object
 22  crew                  4803 non-null   object
 23  director              4773 non-null   object
dtypes: float64(3), int64(5), object(16)
memory usage: 900.7+ KB

### Task 1

**Create new column to fill the profit or loss movie dose as per given data**

creating Subset

In [5]:
task1 = df[["title", "genres", "budget", "revenue",]]
task1.head()

,title,genres,budget,revenue
0,Avatar,Action Adventure Fantasy Science Fiction,237000000,2787965087
1,Pirates of the Caribbean: At World's End,Adventure Fantasy Action,300000000,961000000
2,Spectre,Action Adventure Crime,245000000,880674609
3,The Dark Knight Rises,Action Crime Drama Thriller,250000000,1084939099
4,John Carter,Action Adventure Science Fiction,260000000,284139100

creating profit column

In [6]:
task1["Profit"] = task1["revenue"] - task1["budget"]

C:\Program Files\KMSpico\temp\ipykernel_6724\242327115.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  task1["Profit"] = task1["revenue"] - task1["budget"]

In [7]:
task1.head()

,title,genres,budget,revenue,Profit
0,Avatar,Action Adventure Fantasy Science Fiction,237000000,2787965087,2550965087
1,Pirates of the Caribbean: At World's End,Adventure Fantasy Action,300000000,961000000,661000000
2,Spectre,Action Adventure Crime,245000000,880674609,635674609
3,The Dark Knight Rises,Action Crime Drama Thriller,250000000,1084939099,834939099
4,John Carter,Action Adventure Science Fiction,260000000,284139100,24139100

In [126]:
task1.to_csv('Task_01.csv')

### Task 2

**Find out number of movies a single company made with profit and loss**

In [8]:
companies = df['production_companies'].to_frame()
companies.head()

                                production_companies
0  [{"name": "Ingenious Film Partners", "id": 289...
1  [{"name": "Walt Disney Pictures", "id": 2}, {"...
2  [{"name": "Columbia Pictures", "id": 5}, {"nam...
3  [{"name": "Legendary Pictures", "id": 923}, {"...
4        [{"name": "Walt Disney Pictures", "id": 2}]

In [9]:
task2 = pd.concat([task1,companies],axis=1)
task2.head()

,title,genres,budget,revenue,Profit,production_companies
0,Avatar,Action Adventure Fantasy Science Fiction,237000000,2787965087,2550965087,"[{""name"": ""Ingenious Film Partners"", ""id"": 289..."
1,Pirates of the Caribbean: At World's End,Adventure Fantasy Action,300000000,961000000,661000000,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""..."
2,Spectre,Action Adventure Crime,245000000,880674609,635674609,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam..."
3,The Dark Knight Rises,Action Crime Drama Thriller,250000000,1084939099,834939099,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""..."
4,John Carter,Action Adventure Science Fiction,260000000,284139100,24139100,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]"

**Cleaning the production column to extract the name of company**

Convert the list dictionaries into simple list by 'ast' module in python

In [10]:
#function to fetch particular data(name) from dictionary like data 
def convert(text):
    List = []
    counter = 0
    for i in ast.literal_eval(text):
        if counter < 2:
            List.append(i['name'])
        counter+=1
    return List

In [11]:
# appying function to fetch particular data at particular range in list form
task2["production_companies"]=task2["production_companies"].apply(convert)
task2.head()

,title,genres,budget,revenue,Profit,production_companies
0,Avatar,Action Adventure Fantasy Science Fiction,237000000,2787965087,2550965087,"[Ingenious Film Partners, Twentieth Century Fo..."
1,Pirates of the Caribbean: At World's End,Adventure Fantasy Action,300000000,961000000,661000000,"[Walt Disney Pictures, Jerry Bruckheimer Films]"
2,Spectre,Action Adventure Crime,245000000,880674609,635674609,"[Columbia Pictures, Danjaq]"
3,The Dark Knight Rises,Action Crime Drama Thriller,250000000,1084939099,834939099,"[Legendary Pictures, Warner Bros.]"
4,John Carter,Action Adventure Science Fiction,260000000,284139100,24139100,[Walt Disney Pictures]

For Removing white spaces

In [12]:
def collapse(L):
    L1 = []
    for i in L:
        L1.append(i.replace(" ",""))
    return L1

In [13]:
task2['production_companies'] = task2['production_companies'].apply(collapse)
task2.head()

,title,genres,budget,revenue,Profit,production_companies
0,Avatar,Action Adventure Fantasy Science Fiction,237000000,2787965087,2550965087,"[IngeniousFilmPartners, TwentiethCenturyFoxFil..."
1,Pirates of the Caribbean: At World's End,Adventure Fantasy Action,300000000,961000000,661000000,"[WaltDisneyPictures, JerryBruckheimerFilms]"
2,Spectre,Action Adventure Crime,245000000,880674609,635674609,"[ColumbiaPictures, Danjaq]"
3,The Dark Knight Rises,Action Crime Drama Thriller,250000000,1084939099,834939099,"[LegendaryPictures, WarnerBros.]"
4,John Carter,Action Adventure Science Fiction,260000000,284139100,24139100,[WaltDisneyPictures]

In [14]:
task2['production_companies'] = task2['production_companies'].apply(lambda x: " ".join(x))

In [15]:
task2.head()

,title,genres,budget,revenue,Profit,production_companies
0,Avatar,Action Adventure Fantasy Science Fiction,237000000,2787965087,2550965087,IngeniousFilmPartners TwentiethCenturyFoxFilmC...
1,Pirates of the Caribbean: At World's End,Adventure Fantasy Action,300000000,961000000,661000000,WaltDisneyPictures JerryBruckheimerFilms
2,Spectre,Action Adventure Crime,245000000,880674609,635674609,ColumbiaPictures Danjaq
3,The Dark Knight Rises,Action Crime Drama Thriller,250000000,1084939099,834939099,LegendaryPictures WarnerBros.
4,John Carter,Action Adventure Science Fiction,260000000,284139100,24139100,WaltDisneyPictures

In [35]:
num_movies_by_company = task2.groupby('production_companies').size().to_frame().reset_index()

In [36]:
num_movies_by_company

                       production_companies    0
0                                            351
1               100Bares HaddockFilmsS.R.L.    1
2              100Bares MinisteriodeCultura    1
3                          101stStreetFilms    1
4            1492Pictures DuneEntertainment    1
...                                     ...  ...
3123                              areajapan    1
3124                   i5Films Headquarters    1
3125                                   icon    1
3126                        kNowProductions    1
3127  rustybearentertainment luckycrowfilms    1

[3128 rows x 2 columns]

In [39]:
# Rename the columns of the dataframe to be more descriptive
num_movies_by_company.columns = ['company', 'num_movies']
num_movies_by_company.head(50)

                                              company  num_movies
0                                                             351
1                         100Bares HaddockFilmsS.R.L.           1
2                        100Bares MinisteriodeCultura           1
3                                    101stStreetFilms           1
4                      1492Pictures DuneEntertainment           1
5                            1492Pictures Heydayfilms           2
6                            1492Pictures WarnerBros.           1
7                      1818 LoneWolfMcQuadeAssociates           1
8                                     19Entertainment           1
9    21LapsEntertainment AndrewLaurenProductions(ALP)           1
10                          21stCenturyFilmProduction           1
11                            26Films GoldCircleFilms           1
12                                    2929Productions           1
13                     2929Productions DimensionFilms           1
14             2929Productions GarySanchezProductions           1
15                2929Productions LinsonEntertainment           1
16             2929Productions ParticipantProductions           1
17                          2929Productions WildBunch           1
18                             30SomethingProductions           1
19                  34thStreetFilms HomegrownPictures           1
20                     360Pictures DribbleProductions           1
21            3ArtsEntertainment TheMarkGordonCompany           1
22  3DEntertainment GavinMcKinneyUnderwaterProduct...           1
23         3LFilmproduktionGmbH BleibergEntertainment           1
24                                 3MarkEntertainment           1
25                              3rdPartnerProductions           1
26                             40Acres&AMuleFilmworks           4
27               40Acres&AMuleFilmworks SavoyPictures           1
28          40Acres&AMuleFilmworks TouchstonePictures           3
29           ABCPictures CineramaReleasingCorporation           1
30                                             ABCorp           1
31                          ABandApart DimensionFilms           1
32                        ABiggerBoat RelativityMedia           1
33                     ALoopyProductionLLC 2LoopFilms           1
34                                           ANAMedia           1
35                                        ARTE Inosan           1
36                         ASTStudios LowlandPictures           1
37                        ASpaceBetween MarakeshFilms           1
38                            AVCOEmbassyPictures EDI           1
39    AVCOEmbassyPictures GoldcrestFilmsInternational           1
40     AVCOEmbassyPictures InternationalFilmInvestors           1
41                                         AVPictures           1
42              AardmanAnimations DreamWorksAnimation           2
43                                AbsintheProductions           1
44                             AcajouFilms RebelRebel           1
45  AccessMotionPictureGroup Giraldi-Suarez-DiGiai...           1
46          ActIIICommunications ThePrincessBrideLtd.           1
47                               AdHominemEnterprises           1
48                                    AdScottPictures           1
49                                           AdaFilms           1

get the excel file

In [46]:
num_movies_by_company.to_csv('Task_02.csv')

### Task 3

**Find out production companies more popular movies in different regions**

In [49]:
region = df['production_countries'].to_frame()
region.head()

                                production_countries
0  [{"iso_3166_1": "US", "name": "United States o...
1  [{"iso_3166_1": "US", "name": "United States o...
2  [{"iso_3166_1": "GB", "name": "United Kingdom"...
3  [{"iso_3166_1": "US", "name": "United States o...
4  [{"iso_3166_1": "US", "name": "United States o...

cleaning

In [50]:
# appying function to fetch particular data at particular range in list form
region["production_countries"]=region["production_countries"].apply(convert)
region.head()

                         production_countries
0  [United States of America, United Kingdom]
1                  [United States of America]
2  [United Kingdom, United States of America]
3                  [United States of America]
4                  [United States of America]

In [52]:
region['production_countries'] = region['production_countries'].apply(collapse)
region.head()

                     production_countries
0  [UnitedStatesofAmerica, UnitedKingdom]
1                 [UnitedStatesofAmerica]
2  [UnitedKingdom, UnitedStatesofAmerica]
3                 [UnitedStatesofAmerica]
4                 [UnitedStatesofAmerica]

In [53]:
region['production_countries'] = region['production_countries'].apply(lambda x: " ".join(x))
region.head()

                  production_countries
0  UnitedStatesofAmerica UnitedKingdom
1                UnitedStatesofAmerica
2  UnitedKingdom UnitedStatesofAmerica
3                UnitedStatesofAmerica
4                UnitedStatesofAmerica

In [55]:
company = task2['production_companies'].to_frame()
popularity = df['popularity'].to_frame()

In [57]:
task3 = pd.concat([company,region,popularity],axis=1)
task3.head()

,production_companies,production_countries,popularity
0,IngeniousFilmPartners TwentiethCenturyFoxFilmC...,UnitedStatesofAmerica UnitedKingdom,150.437577
1,WaltDisneyPictures JerryBruckheimerFilms,UnitedStatesofAmerica,139.082615
2,ColumbiaPictures Danjaq,UnitedKingdom UnitedStatesofAmerica,107.376788
3,LegendaryPictures WarnerBros.,UnitedStatesofAmerica,112.312950
4,WaltDisneyPictures,UnitedStatesofAmerica,43.926995

In [153]:
# Group the dataframe by both the company and region columns and calculate the average popularity for each group
company_region_popularity = task3.groupby(['production_companies', 'production_countries'])['popularity'].mean()

In [154]:
top_companies_by_region = company_region_popularity
df3=top_companies_by_region.to_frame()

In [142]:
df3.head(50)

                                                                  popularity
production_companies         production_countries
                                                                    0.909488
                             Australia                              0.619348
                             Austria Hungary                        1.833058
                             Brazil                                 0.389471
                             Bulgaria                               6.265659
                             Bulgaria Canada                        4.304341
                             Canada                                 1.706502
                             Canada UnitedKingdom                   2.651702
                             Canada UnitedStatesofAmerica           5.079017
                             China                                  0.406645
                             China HongKong                         1.685020
                             China Japan                            3.866026
                             CzechRepublic Slovakia                 2.387463
                             DominicanRepublic                      0.080105
                             Finland France                        10.787322
                             France                                 1.635177
                             France Italy                           1.031142
                             France UnitedKingdom                   1.145310
                             France UnitedStatesofAmerica           0.895946
                             Germany                                2.832628
                             Germany UnitedKingdom                  2.397987
                             Germany UnitedStatesofAmerica          3.821496
                             Guyana UnitedStatesofAmerica           0.030253
                             Hungary Germany                        1.906807
                             India                                  0.605244
                             Italy UnitedStatesofAmerica            8.218383
                             Kenya                                  0.327794
                             Mexico                                 0.015597
                             Netherlands                            0.144031
                             NewZealand                             0.706355
                             Pakistan                               0.060003
                             Romania                                0.327622
                             Spain UnitedKingdom                    0.515677
                             UnitedKingdom                          2.358478
                             UnitedKingdom France                   1.464566
                             UnitedKingdom Germany                  0.669169
                             UnitedKingdom India                    0.356495
                             UnitedKingdom Ireland                  4.922397
                             UnitedKingdom UnitedStatesofAmerica    9.651013
                             UnitedStatesofAmerica                  2.105610
                             UnitedStatesofAmerica Argentina        1.045623
                             UnitedStatesofAmerica Australia        0.545825
                             UnitedStatesofAmerica China            0.857008
                             UnitedStatesofAmerica HongKong         0.174311
                             UnitedStatesofAmerica India            0.126304
                             UnitedStatesofAmerica Thailand         2.204138
                             UnitedStatesofAmerica UnitedKingdom    0.069244
100Bares HaddockFilmsS.R.L.  Argentina Spain                       25.894065
100Bares MinisteriodeCultura Argentina Spain                       14.866351
101stStreetFilms             UnitedStatesofAmerica                  0.587276

In [141]:
df3.shape

(3459, 1)

In [143]:
top_companies_by_region

production_companies                   production_countries
                                                                0.909488
                                       Australia                0.619348
                                       Austria Hungary          1.833058
                                       Brazil                   0.389471
                                       Bulgaria                 6.265659
                                                                  ...
areajapan                              UnitedStatesofAmerica    3.803495
i5Films Headquarters                   UnitedStatesofAmerica    1.369649
icon                                   Canada                   2.080741
kNowProductions                        Germany Israel           0.594580
rustybearentertainment luckycrowfilms  UnitedStatesofAmerica    1.929883
Name: popularity, Length: 3459, dtype: float64

In [147]:
popularity_df = df3.reset_index()
popularity_df.head(50)

,production_companies,production_countries,popularity
0,,,0.909488
1,,Australia,0.619348
2,,Austria Hungary,1.833058
3,,Brazil,0.389471
4,,Bulgaria,6.265659
5,,Bulgaria Canada,4.304341
6,,Canada,1.706502
7,,Canada UnitedKingdom,2.651702
8,,Canada UnitedStatesofAmerica,5.079017
9,,China,0.406645
10,,China HongKong,1.685020
11,,China Japan,3.866026
12,,CzechRepublic Slovakia,2.387463
13,,DominicanRepublic,0.080105
14,,Finland France,10.787322
15,,France,1.635177
16,,France Italy,1.031142
17,,France UnitedKingdom,1.145310
18,,France UnitedStatesofAmerica,0.895946
19,,Germany,2.832628
20,,Germany UnitedKingdom,2.397987
21,,Germany UnitedStatesofAmerica,3.821496
22,,Guyana UnitedStatesofAmerica,0.030253
23,,Hungary Germany,1.906807
24,,India,0.605244
25,,Italy UnitedStatesofAmerica,8.218383
26,,Kenya,0.327794
27,,Mexico,0.015597
28,,Netherlands,0.144031
29,,NewZealand,0.706355
30,,Pakistan,0.060003
31,,Romania,0.327622
32,,Spain UnitedKingdom,0.515677
33,,UnitedKingdom,2.358478
34,,UnitedKingdom France,1.464566
35,,UnitedKingdom Germany,0.669169
36,,UnitedKingdom India,0.356495
37,,UnitedKingdom Ireland,4.922397
38,,UnitedKingdom UnitedStatesofAmerica,9.651013
39,,UnitedStatesofAmerica,2.105610
40,,UnitedStatesofAmerica Argentina,1.045623
41,,UnitedStatesofAmerica Australia,0.545825
42,,UnitedStatesofAmerica China,0.857008
43,,UnitedStatesofAmerica HongKong,0.174311
44,,UnitedStatesofAmerica India,0.126304
45,,UnitedStatesofAmerica Thailand,2.204138
46,,UnitedStatesofAmerica UnitedKingdom,0.069244
47,100Bares HaddockFilmsS.R.L.,Argentina Spain,25.894065
48,100Bares MinisteriodeCultura,Argentina Spain,14.866351
49,101stStreetFilms,UnitedStatesofAmerica,0.587276

In [148]:
df3.to_csv('Task_003.csv')

In [150]:
df3.head(50)

                                                                  popularity
production_companies         production_countries
                                                                    0.909488
                             Australia                              0.619348
                             Austria Hungary                        1.833058
                             Brazil                                 0.389471
                             Bulgaria                               6.265659
                             Bulgaria Canada                        4.304341
                             Canada                                 1.706502
                             Canada UnitedKingdom                   2.651702
                             Canada UnitedStatesofAmerica           5.079017
                             China                                  0.406645
                             China HongKong                         1.685020
                             China Japan                            3.866026
                             CzechRepublic Slovakia                 2.387463
                             DominicanRepublic                      0.080105
                             Finland France                        10.787322
                             France                                 1.635177
                             France Italy                           1.031142
                             France UnitedKingdom                   1.145310
                             France UnitedStatesofAmerica           0.895946
                             Germany                                2.832628
                             Germany UnitedKingdom                  2.397987
                             Germany UnitedStatesofAmerica          3.821496
                             Guyana UnitedStatesofAmerica           0.030253
                             Hungary Germany                        1.906807
                             India                                  0.605244
                             Italy UnitedStatesofAmerica            8.218383
                             Kenya                                  0.327794
                             Mexico                                 0.015597
                             Netherlands                            0.144031
                             NewZealand                             0.706355
                             Pakistan                               0.060003
                             Romania                                0.327622
                             Spain UnitedKingdom                    0.515677
                             UnitedKingdom                          2.358478
                             UnitedKingdom France                   1.464566
                             UnitedKingdom Germany                  0.669169
                             UnitedKingdom India                    0.356495
                             UnitedKingdom Ireland                  4.922397
                             UnitedKingdom UnitedStatesofAmerica    9.651013
                             UnitedStatesofAmerica                  2.105610
                             UnitedStatesofAmerica Argentina        1.045623
                             UnitedStatesofAmerica Australia        0.545825
                             UnitedStatesofAmerica China            0.857008
                             UnitedStatesofAmerica HongKong         0.174311
                             UnitedStatesofAmerica India            0.126304
                             UnitedStatesofAmerica Thailand         2.204138
                             UnitedStatesofAmerica UnitedKingdom    0.069244
100Bares HaddockFilmsS.R.L.  Argentina Spain                       25.894065
100Bares MinisteriodeCultura Argentina Spain                       14.866351
101stStreetFilms             UnitedStatesofAmerica                  0.587276